In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split,cross_val_score
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [2]:
df=pd.read_csv("tested.csv",usecols=['Survived','Pclass','Age','SibSp','Parch'])
df.head()

   Survived  Pclass   Age  SibSp  Parch
0         0       3  34.5      0      0
1         1       3  47.0      1      0
2         0       2  62.0      0      0
3         0       3  27.0      0      0
4         1       3  22.0      1      1

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  418 non-null    int64
 1   Pclass    418 non-null    int64
 2   Age       332 non-null    float64
 3   SibSp     418 non-null    int64
 4   Parch     418 non-null    int64
dtypes: float64(1), int64(4)
memory usage: 16.5 KB

In [4]:
df.isnull().sum()

Survived     0
Pclass       0
Age         86
SibSp        0
Parch        0
dtype: int64

In [5]:
df.dropna(inplace=True)

In [6]:
df.isnull().sum()

Survived    0
Pclass      0
Age         0
SibSp       0
Parch       0
dtype: int64

In [7]:
df.shape

(332, 5)

In [8]:
X=df.drop(['Survived'],axis=1)
X.head()

   Pclass   Age  SibSp  Parch
0       3  34.5      0      0
1       3  47.0      1      0
2       2  62.0      0      0
3       3  27.0      0      0
4       3  22.0      1      1

In [9]:
y=df['Survived']
y.head()

0    0
1    1
2    0
3    0
4    1
Name: Survived, dtype: int64

In [10]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=51)
X_train.head()

     Pclass   Age  SibSp  Parch
349       2  31.0      0      0
130       3  32.0      0      0
295       3  26.0      0      0
341       3  32.0      0      0
20        1  55.0      1      0

In [11]:
lr=LogisticRegression()
lr.fit(X_train,y_train)
y_pred=lr.predict(X_test)
print(" Accuracy before construction",accuracy_score(y_pred,y_test))
print("Cross_val_score before construction is: ",np.mean(cross_val_score(lr,X,y,scoring='accuracy',cv=10)))

 Accuracy before construction 0.6716417910447762
Cross_val_score before construction is:  0.6293226381461677

##### Applying feature construction

In [12]:
X['Family_size']=X['SibSp']+X['Parch']+1
X.head()

   Pclass   Age  SibSp  Parch  Family_size
0       3  34.5      0      0            1
1       3  47.0      1      0            2
2       2  62.0      0      0            1
3       3  27.0      0      0            1
4       3  22.0      1      1            3

In [13]:
def myfunc(num):
    if num ==1:
        # alone
        return 0
    elif num>1 and num<4:
        return 1
        # small family
    else:
        # big family
        return 2

In [14]:
myfunc(5)

2

In [15]:
X['Family_type']=X['Family_size'].apply(myfunc)
X.head()

   Pclass   Age  SibSp  Parch  Family_size  Family_type
0       3  34.5      0      0            1            0
1       3  47.0      1      0            2            1
2       2  62.0      0      0            1            0
3       3  27.0      0      0            1            0
4       3  22.0      1      1            3            1

In [16]:
X.drop(columns=['SibSp','Parch','Family_size'],inplace=True)
X.head()

   Pclass   Age  Family_type
0       3  34.5            0
1       3  47.0            1
2       2  62.0            0
3       3  27.0            0
4       3  22.0            1

In [19]:
lr1=LogisticRegression()
lr1.fit(X_train,y_train)
y_pred1=lr1.predict(X_test)
print(" Accuracy after construction",accuracy_score(y_pred1,y_test))
print("Cross_val_score after construction is: ",np.mean(cross_val_score(lr1,X,y,scoring='accuracy',cv=10)))

 Accuracy after construction 0.6716417910447762
Cross_val_score after construction is:  0.6201426024955438

##### Feature splitting

In [20]:
data=pd.read_csv('tested.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [22]:
data['Name']

0                                  Kelly, Mr. James
1                  Wilkes, Mrs. James (Ellen Needs)
2                         Myles, Mr. Thomas Francis
3                                  Wirz, Mr. Albert
4      Hirvonen, Mrs. Alexander (Helga E Lindqvist)
                           ...
413                              Spector, Mr. Woolf
414                    Oliva y Ocana, Dona. Fermina
415                    Saether, Mr. Simon Sivertsen
416                             Ware, Mr. Frederick
417                        Peter, Master. Michael J
Name: Name, Length: 418, dtype: object

In [33]:
data['title']=data['Name'].str.split(',',expand=True)[1].str.split('.',expand=True)[0]
data['title']

0           Mr
1          Mrs
2           Mr
3           Mr
4          Mrs
        ...
413         Mr
414       Dona
415         Mr
416         Mr
417     Master
Name: title, Length: 418, dtype: object

In [40]:
data['Name'].str.split(',',expand=True)[1]

0                                Mr. James
1                 Mrs. James (Ellen Needs)
2                       Mr. Thomas Francis
3                               Mr. Albert
4       Mrs. Alexander (Helga E Lindqvist)
                      ...
413                              Mr. Woolf
414                          Dona. Fermina
415                    Mr. Simon Sivertsen
416                          Mr. Frederick
417                      Master. Michael J
Name: 1, Length: 418, dtype: object

In [42]:
data[['title','Name']]

       title                                          Name
0         Mr                              Kelly, Mr. James
1        Mrs              Wilkes, Mrs. James (Ellen Needs)
2         Mr                     Myles, Mr. Thomas Francis
3         Mr                              Wirz, Mr. Albert
4        Mrs  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..       ...                                           ...
413       Mr                            Spector, Mr. Woolf
414     Dona                  Oliva y Ocana, Dona. Fermina
415       Mr                  Saether, Mr. Simon Sivertsen
416       Mr                           Ware, Mr. Frederick
417   Master                      Peter, Master. Michael J

[418 rows x 2 columns]

In [54]:
(data.groupby('title')['Survived'].mean()).sort_values(ascending=False)

title
Dona      1.0
Ms        1.0
Miss      1.0
Mrs       1.0
Col       0.0
Master    0.0
Dr        0.0
Mr        0.0
Rev       0.0
Name: Survived, dtype: float64